import { useState, useCallback } from "react";
import { useDrop } from "react-dnd";
import Contract from "./Contract";

const data = [
	{
		id: 1,
		content: [
			"قيام الطرف الأول بتقديم خدمات ضريبة القيمة المضافة للطرف الثاني وتقديمها عن طريق الموقع الإلكتروني لمنصة إقرار المربوط بتقديم الخدمة",
			" المضافة للطرف الثاني وتقديمها عن طريق الموقع الإلكتروني لمنصة إقرار",
			" المضافة للطرف الثاني وتقديمها عن طريق الموقع الإلكتروني لمنصة إقرار",
		],
	},
	{
		id: 2,
		content: [
			"تحديد أسعار الخدمات في حالة الإشتراك في الباقات حسب ما يلي:",
			" أسعار الخدمات التي يقدمها الطرف الأول للطرف التاني حسب الباقة التي يحددها الطرف الثاني عند التعاقد",
			" الخدمات اللاحقه التي يتقدم طلبها الطرف الثاني تكون خاضعة لإمتيازات الباقة المحتارة عند التعاقد حسب ما هو موضح في البند الثالث, ويتم إصدار فاتورة مستقلة بالخدمة.",
		],
	},
	{
		id: 3,
		content: [
			"ينتهي هذا العقد بالإنتهاء من تنفيذ الخدمات المحددة من الطرف الثاني",
			" المضافة للطرف الثاني وتقديمها عن طريق الموقع الإلكتروني لمنصة إقرار",
			" الخدمات اللاحقه التي يتقدم طلبها الطرف الثاني تكون خاضعة لإمتيازات الباقة المحتارة عند التعاقد حسب ما هو موضح في البند الثالث, ويتم إصدار فاتورة مستقلة بالخدمة.",
		],
	},
	{
		id: 4,
		content: [
			"تحديد أسعار الخدمات في حالة الإشتراك في الباقات حسب ما يلي:",
			" أسعار الخدمات التي يقدمها الطرف الأول للطرف التاني حسب الباقة التي يحددها الطرف الثاني عند التعاقد",
			" الخدمات اللاحقه التي يتقدم طلبها الطرف الثاني تكون خاضعة لإمتيازات الباقة المحتارة عند التعاقد حسب ما هو موضح في البند الثالث, ويتم إصدار فاتورة مستقلة بالخدمة.",
		],
	},
];

const Contracts = () => {
	const [content, setContent] = useState(data);

	const moveContract = useCallback(
		(dragIndex, hoverIndex) => {
			const dragItem = content[dragIndex];
			const hoverItem = content[hoverIndex];

			setContent((item) => {
				const updatedContent = [...content];
				updatedContent[dragIndex] = hoverItem;
				updatedContent[hoverIndex] = dragItem;
				return updatedContent;
			});
		},
		[content]
	);

	return (
		<>
			{content.map((item, idx) => (
				<Contract
					key={item.id}
					item={item}
					index={idx}
					moveListItem={moveContract}
				/>
			))}
		</>
	);
};

export default Contracts;
